//APFJOB   JOB ,'ARYTEST',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=4M
/*JOBPARM S=RS22
//**************************************************************/
//APF1    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ISP.SISPLOAD
//APF2    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.ARY310.IBMTAPE.SARYLOAD
//APF3    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.ARY310.IBMTAPE.CONTROL
//APF4    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.ARY320.IBMTAPE.SARYLOAD
//APF5    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.ARY320.IBMTAPE.CONTROL
//APF6    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ARY.V32.INT1.LOADLIB
//APF7    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ARY.V32.INT1.DB2.CONTROL
//APF8    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ARY.TST0310.LOADLIB
//APF9    EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ARY.TST0320.LOADLIB
//APF10   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ARY.TST032X.LOADLIB
//APF11   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ARY.TST032X.ISPMLIB
//APF12   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=ARY.TST032X.ISPSLIB
//APF13   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=PDBURTS.ARY6198.LOADLIB
//APF14   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=RSQA.ARY6849.ARY310.LOADLIB
--//APF15   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.ARY6849.ARY320.LOADLIB
//APF16   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.ZCR110.MAINSTAR.SZCRLOAD
//APF17   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.RIS110.MAINSTAR.SRISLOAD
//APF18   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.GCL110.IBMTAPE.SGCLLOAD
//APF19   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.GCL120.IBMTAPE.SGCLLOAD
//APF20   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.BSY210.IBMTAPE.SBSYLOAD
//APF21   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSQA.BSY220.IBMTAPE.SBSYLOAD
--//APF22   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=TSMGM.SMPE.HAHM210.SFRXLOAD
//APF23   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=DSN.EB1F.SDSNEXIT
--//APF24   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=IMSA3SYS.MDALIB
--//APF25   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=IMSIBA2.SDFSRESL
--//APF26   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=IMSIBA2.MDALIB
//APF27   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=IMSICA2.SDFSRESL
//APF28   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=IMSICA2.MDALIB
--//APF29   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=IMSDA2.SDFSRESL
--//APF30   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=IMSDA2.MDALIB
//APF31   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSRTE.EMC.LINKLIB
//APF32   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSRTE.EMC.LINKLIB.BETA760
--//APF33   EXEC PGM=CSVAPF00
--//APFLIB  DD DISP=SHR,DSN=RSRTE.EMC.MFE760.LINKLIB
//APF34   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSRTE.EMC.MFE800.LINKLIB
//APF35   EXEC PGM=CSVAPF00
//APFLIB  DD DISP=SHR,DSN=RSRTE.EMC.V700.LINKLIB
//*
