//SYSINFO  JOB ,'AO TEST',CLASS=A,MSGCLASS=X
//SYSINFO  EXEC PGM=IKJEFT01,PARM='SYSINFO'
//STEPLIB  DD DISP=SHR,DSN=RSRTE.VENDOR.MXIG2.SMXILINK
//*         DD DISP=SHR,DSN=RSRTE.RSRTE.VENDOR.MXX.SMXXLINK
//SYSEXEC  DD DISP=SHR,DSN=RSTEST.GLO.TOOLS.REXX.EXEC
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
