//HSF1010 JOB  'ACCT#','<UNAME>',
//       MSGCLASS=K,NOTIFY=SDSF,CLASS=A,USER=<UNAME>
//STEP2 EXEC PGM=SDSF,PARM='++20,500'
//ISFOUT DD SYSOUT=A
//ISFIN DD *
