//WAIT5MIN   JOB ,'WAITJOB',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID,REGION=4M
//WAIT5MIN   EXEC PGM=BPXBATCH,REGION=0M,
//  PARM='SH sleep 2m'
//STDIN    DD DUMMY
//STDOUT   DD SYSOUT=*
//STDERR   DD SYSOUT=*
/*
