//IVT0000  JOB (ACCT#),' PG V540 ',CLASS=A,MSGCLASS=X,         
//         REGION=0M
//*                                                            
//S1       EXEC PGM=IKJEFT01,DYNAMNBR=30,REGION=0M             
//SYSTSPRT DD SYSOUT=*                                         
//SYSTSIN  DD *                                                
{cmd}
/*                                                             
